# Module 4 project
# Author : Uma M Subramanian
# Repo: https://github.com/umams2002/datafun-04-notebooks

## Task 1. Create DataFrame

In [42]:
import pandas as pd
grades_dict = {"Eva": [56,78,89],
               "Wally": [45,34,90],
               "Uma": [99,100,99],
               "Sam": [45,89,10],
               "Mark": [23,67,66]}
grades = pd.DataFrame(grades_dict)
grades

   Eva  Wally  Uma  Sam  Mark
0   56     45   99   45    23
1   78     34  100   89    67
2   89     90   99   10    66

## Task 2. Custom Index

In [43]:
grades.index = ['Test1','Test2','Test3']
grades.Sam

Test1    45
Test2    89
Test3    10
Name: Sam, dtype: int64

In [44]:
grades['Eva']

Test1    56
Test2    78
Test3    89
Name: Eva, dtype: int64

## Task 3. Accessing Rows (loc, iloc)

In [45]:
grades.loc["Test1"]

Eva      56
Wally    45
Uma      99
Sam      45
Mark     23
Name: Test1, dtype: int64

In [46]:
grades.iloc[2]

Eva      89
Wally    90
Uma      99
Sam      10
Mark     66
Name: Test3, dtype: int64

In [47]:
grades.loc['Test1':'Test3']

       Eva  Wally  Uma  Sam  Mark
Test1   56     45   99   45    23
Test2   78     34  100   89    67
Test3   89     90   99   10    66

In [48]:
grades.iloc[0:2]

       Eva  Wally  Uma  Sam  Mark
Test1   56     45   99   45    23
Test2   78     34  100   89    67

## Task 3. Accessing Subsets (at, iat)

In [ ]:
grades.at["Test2","Eva"]